Tasks/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Task>
		<Properties>
			<Name>Заявка</Name>
			<Addressing>InformationRegister.СопоставлениеАдресации</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Делегировать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВодаКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ФункционалВТекущейИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункционалВТекущейИБ</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/СопоставлениеАдресации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеАдресации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФункционалВТекущейИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункционалВТекущейИБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ШагЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ШагЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
					<Comment>0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеВРаботу</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/Заявка/Ext/ObjectModule.bsl
Процедура ПередВыполнением(Отказ)
	обкБП = БизнесПроцесс.ПолучитьОбъект();
	
	Если БизнесПроцесс.ШагЗадачи = Перечисления.ШагЗадачи.Исполнение Тогда		
		обкБП.ОповеститьСледующегоАдресата("Задача выполнена!");
	КонецЕсли;

	Если (ЗначениеЗаполнено(Делегировать)) Тогда
		обкБП.Исполнитель = Делегировать;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СопоставлениеАдресации.ФункционалВТекущейИБ КАК ФункционалВТекущейИБ
	               |ИЗ
	               |	РегистрСведений.СопоставлениеАдресации КАК СопоставлениеАдресации
	               |ГДЕ
	               |	СопоставлениеАдресации.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Делегировать);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Сообщить("Не установлены функции сотрудника!!!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Корректировка Тогда
		обкБП.Исполнитель = Константы.ПолучательПервичногоДокумента.Получить();
		обкБП.ТребуетУточнений = ЛОЖЬ;
		обкБП.ШагЗадачи = Перечисления.ШагЗадачи.ПринятиеВРаботу;
	Иначе
		// Если Выбранно:
		// Вернуть для корректировки - тогда шаг = Корректировка
		// Самостоятельно - тогда шаг = +1
		// Если выбран коллега по отделу - остаться на текущем шаге (просто передать задачу коллеге)
		обкБП.ШагЗадачи = ?(Выборка.ФункционалВТекущейИБ <> Справочники.ФункционалВТекущейИБ.Исполнитель, 
							Перечисления.ШагЗадачи.Корректировка, ?(Делегировать = ПараметрыСеанса.ТекущийПользователь,
							Перечисления.ШагЗадачи.ПолучитьСледующийШагЗадачи( БизнесПроцесс.ШагЗадачи ), обкБП.ШагЗадачи));
							
		Если обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Корректировка Тогда
			обкБП.Исполнитель = обкБП.ЗаявительФИО;
			обкБП.ТребуетУточнений = ИСТИНА;
		КонецЕсли;		
	КонецЕсли;

	Если обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Завершение Тогда
		обкБП.Завершен = Истина;
		обкБП.ДатаЗавершения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Завершение Тогда		
		подвал = Символы.ПС + Символы.ПС +  " Завершено " + Строка( ТекущаяДатаСеанса() );
	ИначеЕсли обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Отказ Тогда
		подвал = Символы.ПС + Символы.ПС +  " Отказ " + Строка( ТекущаяДатаСеанса() );
	Иначе
		подвал = "";
	КонецЕсли;
	
	обкБП.Комментарий = обкБП.Комментарий + 
	Символы.ПС + 
	Символы.ПС + 
	Символы.ПС +
	ПараметрыСеанса.ТекущийПользователь + 
	"(" + Строка(ТекущаяДатаСеанса()) + ") : " + Символы.ПС + ВВодаКомментария + подвал;	
	
	обкБП.Записать();
КонецПроцедуры
